{
    "goal": "Here are some guests' comments about hotels. My goal is to cluster the comments based on features of the hotel that influenced their decisions; each cluster should have a description of 'discussed feature related to <something>'",
    "example_descriptions": [
    "discussed feature related to customer service",
    "discussed feature related to location",
    "discussed feature related to environmental sustainability",
    "discussed feature related to hotel's community engagement",
    "discussed feature related to personal sentimental value"],
    "texts": [
        "Stayed there about ten years ago an never wrote a review. Old, but very clean accommodations.  Excellent price and the location is FANTASTIC. My daughter laughed at the tiny size of our room which was probably 7 feet across. It had two twin beds (which seemed narrower than a normal twin) and a couple of wall locker type closets. If I recall it had a window air conditioner. Bathrooms were communal and male and female bathrooms alternated floors.   We walked to Times Square about a mile away passing Grand Central Station halfway there. The Empire State building is about a half mile away.  If you are traveling to San Francisco, you might check out  the Marines' Memorial Club & Hotel. It is much more like a regular hotel in amenities and price, but still a great deal for Veterans.",
        "Inexpensive stay for your active and retired military.  Very friendly staff, historic tradition and feel, bargain price and awesomely located in midtown Manhattan fairly close to all.    Located midtown Manhattan...a short walk from 5 th Avenue, Times Square, and Grand Central Station.  There is a library on just about every floor that is well maintained.   This is an old military staffed hostel.  Military pictures and memorabilia scattered around the place...take the time to look around.  It is very quaint...although its shared bathrooms and showers.  There are plenty, so there is really no waiting.     Be prepared, there's no elevator, so if you have heavy bags, you will be carrying them up...however, they will let you us the chairlift to take your bags up.  :-).  There is free bagels and coffee/water in the mornings.   Bedrooms are from tiny to grand..depending on how many beds you need.  Beware, you can save a few $$$ if you are willing to share rooms with others.  Beds are not the best, but its a very cheap stay in NY and they are dry and clean.   P.S. Hotel has a large luggage room you can leave your luggage if you check out but still have time to sight see.…",
        "Seemed nice from the outside, walls are paper thin and people in rooms either side shouted all night long, guy on the front desk insisted on letting me know what room was his, had guys walking outside my room and banging and talking! Felt really unsafe as a solo female! Bed like sleeping in a brick! Wouldn’t recommend at all!!!!",
        "This hotel has SO much potential!  It's in an excellent location on Manhattan, and fairly close to Grand Central Station.  The exterior has a classic look and fits in well in the neighborhood.  And then you step inside... peeling paint, crooked stairs, broken banisters, and bathrooms that are quite simply gross.  You can tell that this place used to be classy... but that was probably 50 years ago.  The library has been well maintained - if only the whole place had the same vibe.  The bedrooms are tiny, which is OK - this is NYC after all - but the mattresses are deplorable.  I have never slept so poorly, and I've spent many a night on a cot in some interesting places around the world.  I would have given this hotel 1 star, except for the amazing staff and the nostalgia factor (and library).  I did appreciate the free bagels (even though they're at least a day old) and the coffee.  P.S. Hotel has a large luggage room, if you check out but still have time to sight see.…",
        "As an OIF/OEF Vet heard about this place many times from shipmates who all recommended “must go.”  Friendly staff, historic tradition and feel, bargain price and awesome midtown location all make it great. Overheard another visitor whining about amenities - can’t believe she ever served. Please keep it like it is for genuine military and veterans.",
        "Stayed here years ago and the place is about the same. A friend and I went to NYC for 3 nights and didn't want to spend a fortune. This did the trick. $65 pp each night for 3 nights. As many of the earlier reviews stated the place could use some TLC, but for the location and price it can't be beat. All the employees who work here are volunteers. There is a canteen in the basement with a vending machine and a table to eat food. There are at least three lounge areas, if you don't want to hang out in your small room which doesn't have TV. There are common restrooms and showers on each for floor. I didn't see any rodents or pests as referred to in the previous reviews. I would certainly stay here again.",
        "Really enjoyed our stay here for a quick 18 th birthday treat, friendly and patriotic staff, helpful and informative. This is an old military staff hostel and we were really honoured to be allowed to book a room for 3 here. We were welcomed and made to feel at home and we loved all the military pictures and memorabilia around the place. Everyone is so patriotic about the place and its history, it’s so warming. It was very quaint and although it’s shared bathrooms and showers, there are so many you don’t really see many other people using them.  Be prepared, there’s no lift but we were helped to carry our VERY heavy bags up by chairlift (Jim helped) My son was also made at ease with free cookies and a play on the piano!  Free bagels and coffee in the mornings was a treat, but get down early as there were lots of new people arriving on 1st September (Labour Day 2/9 and the upcoming Memorial Day for 11/9 probably) so on a couple of days they’d ran out. It’s so close to everything though, 5 th Avenue, Times Square, we just ate out instead.  We would definitely stay here again just to be part of the nostalgia and pride of their country felt here, it really was lovely . Great location too …",
        "This is a place that needs to be avoided. It has nothing to do with a hotel. Although they advertise on Booking.com this is a very low budget hostel with limited facilities.   As my booking was cancelled by Booking.com, I made a direct deal with the hotel. On arrival, the tragedy starts immediately. Ms. Jessica at the reception is talented in destroying your good holiday mood with 90 seconds. Independent what has been agreed by phone, she asks immediately $50 more than agreed. It is unclear to me whether the $50 extra is for the hotel of for Jessica although I expect the latter. And on top of that, she is extremely impolite and even aggresive.   The rooms are really small, indeed 8m2 and dirty. Mattresses seem to be at least 20 years old and smell like hell. Sleeping in Central Park is a better option than on those mattresses.    Towels for the shared shower are same age as the bedlinen and measure the size of a tea towel. Breakfast, being served as of 0700 hours, did not arrive at 7.45 hours.   This is really a horrible place with staff that can not be trusted and should be avoided by everyone. And sleeping 150 night per annum in hotels, I believe I have some experience. Anything positive? Yes, the coffee was ok, and so the location.  …",
        "I spent the better part of my day this past week researching a hotel that could accommodate our small family, was close to Timesquare and under $200 a room. I was super excited when I found this place. The rate was $170 a night for my family of four.  We have stayed at similar places for the military so I was excited to see this place. The outside and inside of this building look beautiful, but it needs some desperate work like others have stated. I read a lot of reviews prior to booking. I take the negative reviews with a grain of salt as some seem to have a complaint regardless of where they stay.  I booked with Jessica- seriously a lovely soul. She was so friendly and outgoing. They had one room left so we took it. I expected it to be small and it was. I had read a review about rats prior to getting to the hotel so was uneasy with the kids. Thankfully we didn't see or hear any, but there was a large box of poison out in the open near the bed closest to the air conditioning. That was a bit alarming that it wasn't hidden. But, it's NYC so I get it. Our beds were terribly uncomfortable. I'm not sure how old the mattresses are but you could feel every springs. The bedding itself was a folded over large Queen spread. Just expected more from a military associated place.   This place is more like a hostel in Europe than a hotel. It would be perfect for single men/women needing a quick stay, but I would not recommend it for families. The bathrooms and showers are not connected which made it more challenging with a 3 and 4 year old. Some of the bathrooms were out of order as well so we were utilizing the men's room a lot which felt wrong. Thankfully, despite being full, we didn't have a wait for the restrooms or showers when we needed them. Breakfast was warm bagels.  The only benefit we really appreciated from this place was the distance to Timesquare. I wanted something closer with the kids so they wouldn't be worn out by the time we reached our activities. It was about an 8 block walk so that was nice. The place itself was disappointing for the rate we spent. So that was tough. There were HIlton brand hotels at the end of the subway route for the same price, but the weekend route was limited so it's a gamble really. I wanted as much time as possible for our outings instead of commuting.     I'm rating this place lower based on the experience with one of the front desk attendants. We had just arrived with our luggage and stroller. The door was not wide enough to get the stroller in so as I'm helping my husband get the stroller in and down the steps into the lobby. I took the kids out and had them go down the stairs. I then hear a man scolding the kids. Confused I turn around to see my four year old with a concerned look on her face. They literally had stepped into the lobby, weren't running, screaming anything so I was puzzled. The man then goes on to tell me horror stories about past awful children they have had there including one young boy with his absent minded mom. This particular child was found in the back kitchen holding a knife. We weren't greeted with a hello, welcome or anything literally a lecture on how our children should behave in the lobby. Now if they were out of control it'd be one thing, but walking through the door after 8 hours of driving was ridiculous. I explained to him that we monitor our children and he didn't need to worry about them disturbing the lobby or other guests. I've worked in the hospitality industry for years so was disappointed in this poor greeting. Later we saw him again. He recommended taking the kids to the ferry and instructed us to leave our keys. That was a bit bizarre as well, but maybe there is a history of tenants losing their keys. We declined and continued onto our evening activity.  So if you are traveling with a family I'd avoid this place and plan for a longer commute.…",
        "At first I was very amazed at how the exterior of the building stood proudly on Lexington avenue. I noticed that this establishment accommodates military, veterans etc but at no point was I asked for proof of my affiliation which was a bit of a turn off.   The stair railings were being held together with shoelaces, ropes and other ties which made carrying the luggage upstairs a bit scary.  As soon as I got settled ( around 11-12am) I saw a young mother and her child frantically exiting the nearby room with all of their belongings. Before I could get any words out of my mouth I saw what seemed to be a black kitten with a long tail.  Unless someone was filming ratatouille, it didn't take a genius to see what was going on here.  I assisted them down a few flights, and began to google nearby accommodations.  I'm not sure what happened after that but I did exit quietly around 1230am and the mom was still in the lobby searching for another place to stay.  What a disappointment and I was too tired to even care to interrupt her to try to get a refund so I quietly exited the building.   I would definitely say that this is a health hazard to anyone deciding to stay there because exposure to droppings can also be sickening whatever types of rodents are crawling around in there, especially the 3 that met me at the door as I left. No TV in the room, but there are TV rooms and libraries on each floor. Bathroom was clean. The fact that there was no tv in the room made me focus on the rodent sounds of them scurrying from the room beside me. Floor board was lifting and I can see how they travel room to room.  As an old building, I understand that it has structural issues but if they can spend less money on the decoration and just focus on cleanliness and safety as a primary responsibility, I'd say that they can rival many nearby hotels. Good luck!…",
        "I stayed at the SSMA Club as part of a group of 20 soldiers visiting from the UK. The Club was perfect for what we needed. It was clean and tidy, it is in the perfect location for exploring NYC and the staff were really great.  The ablutions are all shared, which was not a problem for my group, and although the Club could probably use a bit of a face-lift it has a wonderful 'old world' charm.  There was always fresh coffee available and plenty of fresh bagles every morning... A great no thrills base that I would definitely recommend.  Thanks to all at the SSMA Club for making our stay in NYC so comfortable. ",
        "First, the staff were so polite. Booking was a breeze and everyone was so friendly. The location is perfect. Right in the middle of everything. However, the rooms and hotel in general are outdated: *There are only twin sized beds that kinda scattered randomly throughout the room. I could feel every single spring in the mattress, super uncomfortable. The linens had rips in them.  *The doors have major cracks in the them (they’re uneven) making it hard to cool or heat properly.  *There is only one shower and one bathroom for men and the same for women on each floor. So when you have to get up and go use the bathroom prepare for a walk outside of your room.  *The walls are paper thin.  *There are 4 stories and no elevator.  *The parking is blocks away, we were given a voucher and…",
        "After booking I received a confirmation that I was able to check in early. Upon arrival, the gentleman at reception stayed on a personal call for ten minutes. When he finally got off the phone, he told me I wouldn’t be able to check in early even after being shown the confirmation email. Luckily the price and location is enough to make this place worth it.",
        "Perhaps, years ago, this was a nice place but no longer. Broken railings, dust covered pipes, smelly rooms, dirty floors, neglected maintenance and indifferent staff make this a terrible place to stay. The history is amazing, but nothing short of a complete renovation will save this place. And the breakfast? Seems like it was more for the staff and their friends than guests. The bagels showed up late (7:20), no spread and strange people off the street (traffic cop, some random dude) popped in to grab coffee and a bagel. This place needs a lot of time, money and a complete do over. It has potential and perhaps because it’s lower east side location and no mortgage, the trust that owns it is relaxed. But they should reconsider. Gut it. Install nice rooms, modernize the baths and…",
        "We love this place!  I stayed here for a year previously.  We love all of the military memorabilia.  The library is beautiful.  Our room was cozy.  Free bagels for breakfast.  We love Hazel.  Michelle, Jessica, Shayna, and John are great at the front desk.  Nelda and Laurent are excellent housekeepers.  Mille & Teresa do a lot of good work behind the scenes.  Lots of other great people working here.  Tremendous location in mid town Manhattan.  Very good value.",
        "An 80 year old friend and I stayed there in May.  We were on the 3rd floor, which was a nice hike.  I loved everything about it:  the history, the quaintness of the rooms, the public rooms, the staff and other guests.  The communal bathrooms were always free and clean.  I became a ny bagel fan; great bagels every morning.  I also appreciated that the club is a venue for events such as Al-Anon meetings, Kentucky Derby party, etc.   I will say that my friend was less impressed, but she's more upscale and older than me.   Of course, great location.  Bus stops across the street and metro a 5 minute walk.  Staff all helpful and welcoming.  Would return in a heartbeat.",
        "Stayed here four nights and loved every minute I was there!  You cannot beat the price for this amazing location, cannot!!  Close to subway, walking distance to Times Square, restaurants a step away in any direction.  I will definitely stay here again.  Thanks to the management there for taking care of us old Soldiers!",
        "I made the reservation 4 months in advance and requested a 3 single bed room for myself, my husband and our daughter.  I was sent an email confirming the room and was even assigned a room number.    However, we arrived at the hotel on Good Friday and they tell us they gave our room to someone else.  Therefore, they wanted us to stay in two separate rooms.  One room for myself and my daughter and one room for my husband...who had to share a room with a stranger.  I explained that my DH suffers from PTSD and can not share a room with a stanger...and what happened to the room we were assigned???  I asked for a refund and they gave me one night back, even though I paid for two nights.  All she kept saying was sorry...no explanation as to why we were not getting the room we were…",
        "Great place to stay.  Hostel environment with common bathrooms.  Aged building with plaster work (some showing its age). Bagel and coffee breakfast. Very clean. Staff very friendly.  Great lounge area.  Good stay ",
        "I checked into a private room on the 4th floor on Tuesday the 29th of November 2016. I made a single room reservation well in advance . I am well aware of the room mate situation .I have stayed there beofre in a female 2 bedroom and both times was never bothered by a room mate . In order to avoid the roommate I precisely reserved a single private room $85.00 a night.  It was on the 4th floor tucked away but across from the gents bathroom . Starting at about 1:15 am until 2:30 am there was a parade of drunken Royal Air Force Rugby players . The ruckus was deafening heavy steps and yelling drunken raucous 20 of them at least pounding creating chaos on the entire 4th floor . I opened my door at 2:30 and asked them to quiet down . They paid no attention claiming they had won their…",
        "A great location, and an interesting place.  Not for everyone, but ideal if you're doing NYC on a budget.  You need to be military or ex, US or allied nation.  You're sure to meet interesting fellow-guests, and enjoy the complementary breakfast. Public rooms are fine, bedrooms a little Spartan, but 5 Stars in my book...",
        "I like this place very much.  This is my third stay here.  The people who work here are warm and friendly.    The place has seen its best day and it is seriously dated but it is inexpensive and in a great location.  And having to be military to stay here, you feel like you're with your own.  And also there are some serious museum quality photos and artifacts around this place.  ",
        "This a tough review to write. The club is not a hotel and they don't pretend it is. It is essentially a hostel for adults with a connection to the military. My son and I chose the club because we thought it would be a cost-effective alternative to a hotel in NYC. It cost $85/night for the two of us, which is much cheaper than most hotels, though I learned that I could have had a room at the boutique hotel the next block over for $115/night plus tax using the Hotel Tonight app.  The room was VERY small. It was barely wider than two twin beds. There was also a wall locker, small desk, and dresser in the room. The air conditioning was a window mounted unit. The room was clean, but well worn. One electrical outlet did not work. The shared shower facility was marginal (my 17 year old…",
        "Can't beat the location at this price. Fairly clean.  The mattress seemed to be from 1920. Common bathroom/showers.  A bit seedy, but glad to stay there nonetheless.  It was so nice to park the car and just walk everywhere.  The hotel has no parking, but a couple blocks away I paid about $120 for 4 days of parking.",
        "Location can't be beat for the price - just blocks away from the Empire State Building and about a 20 minute walk from Times Square and Rockefeller Center . Hotel is more like a European hostel with basic private sleeping rooms and community bathrooms. The building is \"rustic\" and in need of some TLC, so manage your expectations. But you don't come to New York City to hang out in your hotel room.    Quick note about parking: the Club has vouchers for 24 parking that have to be paid daily by the 24th hour and you'll need a coupon for each day (that the club will provide).   Thank you to the Soldiers Sailors Marine Club for your hospitality.  ",
        "A hotel this is not, more like a historic b&b. It's truly a gem though! The club itself is full of military memorabilia and has a museum like quality. I booked a private room for 2 with a double bed, came out to $160 a night for both of us, as my husband is an officer so rate is a bit higher. It was small, but very comfortable and came with a mini fridge and desk/chair, closet + air conditioner. I don't know if they have larger rooms, but it may be too close quarters for a cpl trying to spend more than just a long weekend. You really can't beat it for the price and location though...plus it's extremely clean and no little many legged friends :) I have gotten bed bugs, while living in NYC years ago and this is always something I'm extremely concerned about with any hotel…",
        "I am an experienced traveler.  I sometimes even stay at the Hilton in NYC.  But when I am traveling alone, my first choice is Soldiers Sailors Marines Club us my first choice due to the $65 I pay to stay with NO TAX.  (Compared with hundreds elsewhere.)  Yes...you may bunk with others and the bathroom and showers is down the hall.  But its safe and clean.  (Yes it's old and worn...but absolutely not dirty.)    Self serve bagel and coffee or tea in the morning.  You can park 7 p.m. to 7 a.m. right out front...but then you have to move.  Me being the cheap traveler, I move my car to free parking Harlem during the day and take the subway back to midtown.  (But do watch the signs, particularly for street cleaning and do park 6\" from the curb.)  This hotel is in the middle of the…",
        "Room was tight, but if you were in the military, it doesnt matter.  For the price, in the middle of all of the attractions of NYC, you cannot  complain at all. The staff is what made this experience wonderful.  From the minute I called to make a reservation, until the morning I departed, the staff there knew exactly what to do and advised on where to go and how to get there.  A special warm thank you to: Margaret, Michelle, Jessica, Nilda and Jean!!! Bravo Zulu.  Keep up the good work :)",
        "Stayed here in 1979 when I was a broke E-1 and twice more in the last several years.  It is old, the rooms small as are the beds, and the staff is well, not well paid.  But what a great place to stay.  It is inexpensive, historical, you meet other veterans, and a great location.",
        "I have stayed here many times over the past ten years. It is basic, clean and has a nice breakfast bagel, refrig available and a European hostel flavor. You can stay here for $65 bucks or at the Marriott for $575. Short ten minute walk to Grand Central, Bryant Park the Library and Times Square. City transportation is at the doorstep. If comong from La Guadia you can take the bus to Grand Central and walk to the club. I found the staff to be kind and efficient. Some of the previous snide comments were silly. Truly, what did you expect in Manhatten for $65?",
        "I would never recommend anyone to stay at this broken down, dirty, rude staff, uncomfortable bed place.  We felt like we were staying in a homeless shelter. You are required to pay $10 cash deposit for the key to the room you just paid for. It is bare bones, no nothing in the rooms. The rooms had dirty, stained carpet and an external air conditioner in the window that was very very old and rattled and hummed like a broken down car.  When asked if I could get an extra pillow the staff said \"ya upstairs in the closet.\" When I went to the closet it was jammed in a very dirty closet with cleaning supplies and bags of towels/sheets stacked 6 feet high. This made me sick to think that the sheets that I am going to sleep on came from this mess!  The cost for this is not that…",
        "This is the second time I have stayed here. Once for 4 nights back in 2008 and my husband and I stayed here for 5 nights this past week while in NYC on vacation.  Not much has changed at all in the past 8 years.  The plus points are the location. It's just a short walk to Grand Central where you can take the 7 to Times Square or anywhere else and there is a deli and Scotty's 24 hour diner both on Lexington Ave and both are very good.  The other is the price! You will not find a cheaper place to stay in a safe neighborhood anywhere that I know of in NYC!  We returned home one night at 1am and felt very safe.   It is rundown and on the dirty side. They do the very basics cleaning wise. We made the mistake of moving the beds together to make one big bed and it was obvious no one…",
        "First time to NYC and LAST time at this hotel. Having stayed several times at the Hale Koa Hotel in Hawaii and the Marines Memorial Hotel in SF I expected this military hotel to be over the top being in NYC.  Great website looks nothing like the room we stayed in very low rent. Use to being on an adventure but this place has not been updated since the British owned NYC.",
        "You pay so much less to stay here, than anywhere in NYC! you may have to climb a few flights of stairs and share a bathroom, but they give you free bagels so it evens out. Pretty good location, walk through fashion district to get to Times Square or Broadway. Close to Central Station. Staye with kids, and will return.",
        "First: bring a hair dryer if you want to use one! The write up about this club says hair dryers are available for a $10 deposit, however, Not One was available this past weekend. But since I got past my bad hair day, I have to agree that the experience was quite enjoyable. This is more like living in someone's house than it is like staying in a hotel, and that is part of the charm. Very comfortable, hot showers, excellent bagels in the morning, and pretty Christmas decorations all around. I felt a little like I was coming home in the evening.",
        "Just got back from our first trip to New York. This was our 2nd anniversary trip and we were so thankful to find such a great place to stay for such a great price! We stayed two nights and not one complaint! Very clean, cozy room and facilities were well kept. Bathroom close by and showers just one floor up. Much better than I expected concerning the bathrooms/showers!! Great location and within walking distance to Grand Central Station - which is how we primarily got around! Jessica at reception was the BEST - very friendly and helpful!! We definitely hope to be back!!",
        "I am so glad we found this place!  Super affordable.  Clean.  Friendly staff.  A bit like being back in college with the public bathroom and shower, but it was very secure and for the price, I can't complain.  I loved just looking around the old building at the pictures.  Great experience!",
        "If, this military facility wasn't available, we probably wouldn't be able to afford to stay in NYC. This is a beautiful, old building on Lexington Ave. The location is great. The facility is very clean, the staff was friendly and helpful. My husband and I, booked the \"VIP\" room, which is a queen bed and shared bath and showers. To get to the sleeping areas, you have to climb two flights of stairs. There is a chair lift that I used to go upstairs, which was an adventure in itself. Lol It was easier for me to walk downstairs The whole facility needs to be updated, badly. There is a public room with TV, a wonderful old library, and a little kitchette, with fresh bagels and coffee in the morning, along with newspapers. That being offered saves quite a bit of money. Also, take…",
        "First let’s be clear this is NOT the Park Plaza. The rooms are small, usually twin beds and shared bathrooms.  You’re in the heart of Mid town with a room that is like $65 bucks’. I have stayed here a number of times both in winter and summer. The last time was about 2 or 3 years back. We went to see a play had a nice dinner and spent the night. At the time it was $55.00 @ person and in the morning they use to have fresh bagels and coffee in the kitchen. I think they don`t do that any more but you could use the kitchen facility and make your own breakfast. The rate may have gone up a few bucks but still it is a great bargain. They have a few parlors with TVs on each floor and I believe a number of books in one for reading. You need a copy of your DD-214 or military ID when you…",
        "We've stayed here a few times only because the price is right and it's in a great location - a short walk to Grand Central.  The employees are very rude/the service is slow but I have gotten used to it and just understand that you get what you pay for. The bathrooms are fairly clean.  The rooms are dark and a little sad looking.  I would definitely not spend much time in the actual hotel but it is a great place to crash for a couple of nights at a great rate.",
        "Stayed there recently month for the eighth time, and, once again, got exactly what I bargained for.  I have a hard time reading \"terrible\" reviews for this place.  Wake up, folks!  You're paying ridiculously low rates for a place in the heart of Manhattan!!  I've always found it clean and never had a problem with anything.  Yeah, they aren't great at customer service, and the place is sorta rundown, but I always feel like I get my money's worth.  If you want more, pay more and leave this place for those of us who appreciate it!  We're very happy.",
        "We were very disappointed in this place.  We stayed for 2 nights during the winter and we had to have the window air conditioner on because they could not adjust the heat which blasted.  They used a flat sheet for the bottom which was too small and could not be tucked into the sides.  Therefore, when you moved during the night the sheet crumpled up into a ball.  There was no mattress pad either.  We asked at the front desk and they said all of the sheets were locked up.   I could not get past the cast of characters that seem to frequent this place as \"regulars\".  They seem to have a run of the place and do not mind interrupting others space.  It seemed more like a halfway house than a place for our military.  This should not be advertised for the military.  Additionally it was…",
        "I took my family on their first trip to New York City. My wife and I have been many times together and separately, and realized that the cost for regular hotel rooms for a family of five would average $400-$600 per night.  The Soldiers Sailors Marine Club has family rooms for up to six people. We spent $175 per night, weren't charged for the extra bed, and didn't have to worry about the empty bed in our room being filled.  Pluses:  - the Club is centrally located, a few blocks from Grand Central and the Empire State Building - the neighborhood is safe and has affordable restaurants within a 5-minute walk - the beds were comfortable and it was remarkably quiet on the top floor - the free bagels were warm every morning, along with the free coffee and hot chocolate - there were…",
        "I knew that the hotel was not going to be nice and that the rooms were affordable. However, it was much worse than I anticipated. The lady at the front desk was extremely rude when we got there, she barely looked at us and seemed annoyed. There are no elevators, so you have to go up flights of stairs to get to your room. The stairs looked like they were about to topple over. Rooms are TINY, there are two twin beds laid front to back because there is not enough room to lay them side by side. Room AC barely worked and room didn't look clean at all.  Showers/bathrooms are separate, so that is a little weird but not a big deal. However, I would not stay here again. Next time I will pay more money and get a hotel where at least the AC works. The location and price were good though.",
        "We have been around, in the U.S. and in Europe and we've stayed in many military lodging facilities, but this takes the cake.  It is poorly kept up (i.e.:  duct tape on the air conditioner attempting to hold it in the window), an air conditioner that doesn't blow out cool air.  It also it is need of a good cleaning.  Ok, I know it's New York City, and a wonderful location but I feel that this facility is an insult to the military.",
        "It was my first time in New York City and I have to say that staying at this place could not have been a better experience.  The room was sparse, but I was only staying there to sleep.  The rooms, bathrooms, and showers were immaculate.  I really have nothing but good things to say about my stay at the Soldier, Sailor, Airman, and Marine Club and I would definitely stay there again.",
        "This hotel is a good value if you're just looking for a place to crash. It is not fancy by any stretch of the imagination, but decent.  It is available only to military folks and the living conditions are dorm-like. You are sharing a room with strangers (unless you are lucky to have enough people in your party to get one room for all of you) and you are sharing the bathrooms. The best thing about this hotel is its location, right off the FDR and away from the traffic of midtown Manhattan.",
        "Totally cool place to stay!  The old building is nearly 100 years old and is open to members of military, or public service (ie firemen, policemen), reserves, retired, etc.  A real gem - tons of character & charm with all the old military pix on the walls, architecture, etc.  We were two couples - Gunny & Me, my daughter & her boyfriend.    Okay, it is a little faded; it could do with some updating:  it needs new paint, new bedspreads (ours was faded and torn), tile floors in baths need bleached and scrubbed, newer furniture in rooms and common areas) It really looked like nothing had changed since about 1970.  There was some junk piled in back corners and rooms.    BUT, that said - it's a great place for the price!  Yeah, the room was tiny, but it was clean.  Yes, the bathrooms…",
        "This hotel is for military and their families, as well as police and firefighters. The rooms are substantially cheaper then other hotels in NYC. The rate per person and it is based on rank and age. This hotel does not have an elevator and the family rooms are on the fourth floor. Our family room had six twin beds in it and a desk. There was also a tv with cable and an ac unit in the window. Bathrooms and showers are shared by gender. Each morning in the lobby they provided free coffee and free bagels. There is free wifi in the building and computers and printers on the main floor.  There are two subway stations nearby. There is no parking, but they will give you a coupon at the checkin desk for parking.",
        "Just returned from a 4 day stay at the club. What a cool place! Very historic, comfortable, and friendly place to stay! I was there with my husband and 14 year old daughter. My husband and I are both retired military so felt very comfortable in this atmosphere.  The club is very comparable with a nice BOQ.  If you get that, you will know what to expect and won't be disappointed that this isn't a traditional hotel.  That being said, they provide bagels, coffee, and oatmeal free for breakfast, great advice on how to get around, a great location just a few blocks from Grand Central Station, the Morgan Library, and the New York Public Library - Main Branch.  We felt very safe in MidTown as well and it was relatively quiet.  We would definitely stay there again!",
        "I have stayed here four times while visiting New York City.  If you are simply looking for a place to sleep and qualify to stay, this is a great choice.  The location is fantastic -  Mid-town, Murray Hill, close to Grand Central and bus lines.  I usually travel by myself here and have always considered this area relatively safe.  The bathrooms/showers were renovated since my last stay and are more pleasant.  I enjoy the library to relax and watch a little TV if I'm in by early evening.  I enjoy breakfast at Scotty's down the street which always seems to be bustling during the weekday mornings.",
        "We took a 5 day trip to NYC and were fortunate to get two beds.....this is a bare bones place, but you can't beat the price and location.  Yes, there are a lot of stairs and they creak with age.  The bathrooms and showers are down the hall, but they are clean.  The people staying at this hotel are typically used to some sort of military experience and they are friendly.  Good internet offered in the common space, the bagels and coffee were good, but you gotta get there early or it's all gone!  What is interesting is that you rent a single bed in the room, so if you are traveling alone, you may discover a roommate.    The nicest thing is you can walk out of the hotel in the heart of Manhattan and walk to the Empire State Building, Macy's, Times Square, etc.  The subway is nearby…",
        "I didn't stay there because I canceled my reservation two weeks prior to the date, I had reserved.  However, I was charged for one night $125 as no show.  Unfortunately, I didn't have a cancellation number with me, so I was refused to get a refund.  With my phone record, I told the lady on the line that I made a reservation on that day, and canceled it on this date.  However, she told me that my reservation was never made the day, I called in to make a reservation, but the reservation was made the day, which I called in to cancel the RESERVATION.  Please, be careful when you have to cancel the reservation.  You might need to do triple checks.",
        "The price is outstanding for a hotel in Manhattan and as long as you only need a bed, it is perfect. The staff is friendly and helpful, they offer a continental breakfast, and it is in the perfect location for utilizing public transportation.",
        "We stayed here for 4 days, i was a little afraid of coming to NYC for the first time and also staying at this hotel, however, we are so pleased to be in the heart of Manhattan! The hotel was what you paid for, BUT! But, it's the historical feeling of it inside and out, makes you feel like a New Yorker for a few days, the bathroom were next door, and everything was super clean, the housekeeper cleaned our rooms everyday and we had towels and fresh linen, and bagels with coffee every morning. The location of the hotel is so convenient for famous things in NY and we were excited we didnt have to walk too far from the Time Square, Crysler Building is actually can be seen, Empire State and Macys are around the corner, we will definately stay here again, and will recommend if you are…",
        "Summer 2011 stayed here for about 2 weeks - great location.  (Helpful hint - Stair-wise - the 1st floor is actually the 2nd floor in exterior photo (no elevator, but a stair-lift for handicapped). Summary: Very helpful, professional staff working with a somewhat old reservation system.  Most rooms hold 2-3 cots. You rent the cot & locker - not the room (shared bathroom & showers are located in the hallways). Saying that, I found all of my roommates to be friendly with interesting military/DOD backgrounds - which is good because the rooms are NYC tiny.  To read, there is a library on 2nd floor (w/TV). To eat, there is a canteen on lobby floor (w/TV). To visit with friends, there is a lounge off the lobby (w/TV & internet).  Guests are not allowed above the lobby floor.  I'm…",
        "I have stayed at the SSMAC (Soldiers Salors Marines & Airmans Club) several times.  I have stayed there solo and with my wife.  For th location in mMidtown Manhattan The Price and accomodations can not be beat.  The Building is a wonderful brownstone Build in 1880 and occupied by SSMAC since 1920.  Rich in history! Explore the rooms & architecture while there. Every room is filled with important pictures and momentos of history.  There is a full kitchen on first floor available for you to use.  ther ar TV lounges, Library and free internet use.  The rooms are very simple and dated.  You get a bed, a wall locker for personals and a desk.  Bathrooms and showers are not located in the room.  They may be down the hall or another floor.  Not a big concern.  After all when Im in NYC I…",
        "My wife and I have stayed here twice and have no plans to stay elsewhere in the city unless we're attending some kind on convention and the rooms are paid for by the organization.  This is not a 4 star hotel, and it is not advertised as such.  It is a clean, affordable place to stay in a great location.  When we travel to New York, we use the subway almost exclusively to get around -- its the only place that we go where we do not rent a car.  SSMC is in easy walking distance of Grand Central Station and from there you can go anywhere in the city.  There are good restaurants nearby, including all of the shops and the food market located in Grand Central Station.  I mean, you are located in the heart of the city!  Except for a couple of rooms, all beds are single beds and the…",
        "Rooms were small but I knew that going in. Enjoyed our stay. It was warm and welcoming. Though I was a bit deceived by the price! I thought we'd be paying $45/night. It was actually $45 night PER person! Oh well still way cheaper than the cheapest hotel in the area! If you dont mind shared bathrooms this worth it.",
        "Just left NYC yesterday after five days of staying at the Soldiers Sailors Marines Club. You will not beat this value anywhere in NYC unless you are staying with friends in their apartment. The building which houses the SSMC is old and screams history. If you want a cookie cutter hotel room for $300 a night head elsewhere but if you are looking for a unique experience which only few can talk about stay in the SSMC.   The SSMC staff were all wonderful. I read reviews on the club prior to making reservations and was expecting a \"not so warm\" welcome. When we arrived the staff were friendly and kind. I guess you get out of it what you put into it.  The building itself is old and looks it but it serves it purpose well, just a place to crash after seeing the sights. I am planning my…",
        "The SSMC is for service members and their families.  This is more like a hostel in Europe, small bedrooms, community bathrooms, no frills.   However, it is clean and you will not find another place downtown at the price.  If you are looking for a 4 star experience, go elsewhere, but if you want a place to stay the night while you enjoy the City, this is an excellent opportunity.   Reservations must be made over the phone.  Don't expect to see any computer systems, recommend that after making the reservation, you call back to ensure they are still expecting you.  Service is respectable, again, not 4 star, but you can not beat the value.",
        "We stayed at the Soldier Sailor Club for 3 nights and wish we had known about it for previous trips to the City.  The club is currently undergoing rennovations, but presently looks like a well-lived in 1940's hostel (or what I imagine as such).  There are no elevators for the 4 floors and you have to walk down the hall to shared (but separated by gender) showers and restrooms.  The front door staff is on duty 24/7.  The rooms were nothing special, but perfect if you're just using them to crash at night.  The beds are not soft, the towels are not plush (and bring your own if you dont want blue fuzz on you), but the rooms and bathrooms were quite clean.  It seemed that most of the other patrons were middle aged and older.  The neighborhood is yuppified and safe, with lots of…"
    ]
}